Autodesk.Revit.DB.PointCloudType.GetPath
Gets the path of the link source from which the points are loaded.
Returns:
Returns the file path for a file based point cloud or null for the non-file based point cloud.
Since:
2016

Autodesk.Revit.DB.PointCloudType.Create(Autodesk.Revit.DB.Document,System.String,System.String)
Creates a new point cloud type for a given point cloud engine.
Remarks:
A list of supported engine identifiers and whether they are file-based or not can be
obtained from PointCloudEngineRegistry. The method GetSupportedEngines() returns a list
of the identifiers registered for engines.
document:
The document in which to create the point cloud.
engineIdentifier:
The string identifying the engine to be invoked.
It should be the file extension or engine identifier registered by the third party.
typeIdentifier:
The file name or the identification string for a non-file based engine.
Returns:
The newly created PointCloudType object to be used to create instances of
this point cloud.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The engine identifier was not found in the Revit session.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The external file could not be found or loaded.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create a point cloud from the third party engine.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.PointCloudType.FoundStatus
Shows whether the Point Cloud external file could be found.
Since:
2012

Autodesk.Revit.DB.PointCloudType.ColorEncoding
The color encoding used by points extracted from instances of this point cloud.
Since:
2012

Autodesk.Revit.DB.PointCloudType.Offset
Returns the offset stored in the point cloud.
Remarks:
All points are assumed to be offset by the same offset vector.
The offset will be used by Revit if the user chooses to place an instance
relative to another point cloud (the "Auto - Origin To Last Placed" placement option).
Since:
2012

Autodesk.Revit.DB.PointCloudType.Scale
The multiplier applied to the points in all instances of this point cloud.
Remarks:
Scale converts the units in which the coordinates of individual points
of the point cloud are interpreted.
Since:
2012

Autodesk.Revit.DB.PointCloudType.EngineIdentifier
The identifier of the engine responsible for handling of the point cloud.
Remarks:
The built-in engine provides "pcg" here.
Since:
2012

Autodesk.Revit.DB.PointCloudType
Represents a type of point cloud loaded into a Revit document.  Each PointCloudType maps to
a single file or identifier (depending upon the type of Point Cloud Engine which governs it).
Since:
2012